{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "Inpt_conv", "class_name": "Conv2D", "config": {"name": "Inpt_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "Inpt_bn", "class_name": "BatchNormalization", "config": {"name": "Inpt_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Inpt_conv", 0, 0, {}]]]}, {"name": "Inpt_relu", "class_name": "Activation", "config": {"name": "Inpt_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Inpt_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk1_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk1_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Inpt_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk1_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk1_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk1_Res1_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk1_Res1_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk1_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk1_Res1_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk1_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk1_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg1_Blk1_Res1_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk1_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk1_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk1_Res2_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk1_add", "class_name": "Add", "config": {"name": "Stg1_Blk1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Inpt_relu", 0, 0, {}], ["Stg1_Blk1_Res2_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk1_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk1_add", 0, 0, {}]]]}, {"name": "Stg1_Blk2_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk2_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg1_Blk1_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk2_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk2_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk2_Res1_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk2_Res1_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk2_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk2_Res1_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk2_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk2_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg1_Blk2_Res1_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk2_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk2_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk2_Res2_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk2_add", "class_name": "Add", "config": {"name": "Stg1_Blk2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg1_Blk1_relu", 0, 0, {}], ["Stg1_Blk2_Res2_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk2_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk2_add", 0, 0, {}]]]}, {"name": "Stg1_Blk3_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk3_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg1_Blk2_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk3_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk3_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk3_Res1_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk3_Res1_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk3_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk3_Res1_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk3_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg1_Blk3_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg1_Blk3_Res1_relu", 0, 0, {}]]]}, {"name": "Stg1_Blk3_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg1_Blk3_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg1_Blk3_Res2_conv", 0, 0, {}]]]}, {"name": "Stg1_Blk3_add", "class_name": "Add", "config": {"name": "Stg1_Blk3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg1_Blk2_relu", 0, 0, {}], ["Stg1_Blk3_Res2_bn", 0, 0, {}]]]}, {"name": "Stg1_Blk3_relu", "class_name": "Activation", "config": {"name": "Stg1_Blk3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg1_Blk3_add", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Stg1_Blk3_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk1_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk1_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "Stg2_Blk1_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk1_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk1_Res1_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk1_Res1_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk1_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk1_Res1_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk1_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk1_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg2_Blk1_Res1_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk1_lin_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk1_lin_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "Stg2_Blk1_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk1_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk1_Res2_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk1_add", "class_name": "Add", "config": {"name": "Stg2_Blk1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg2_Blk1_lin_conv", 0, 0, {}], ["Stg2_Blk1_Res2_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk1_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk1_add", 0, 0, {}]]]}, {"name": "Stg2_Blk2_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk2_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg2_Blk1_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk2_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk2_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk2_Res1_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk2_Res1_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk2_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk2_Res1_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk2_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk2_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg2_Blk2_Res1_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk2_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk2_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk2_Res2_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk2_add", "class_name": "Add", "config": {"name": "Stg2_Blk2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg2_Blk1_relu", 0, 0, {}], ["Stg2_Blk2_Res2_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk2_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk2_add", 0, 0, {}]]]}, {"name": "Stg2_Blk3_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk3_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg2_Blk2_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk3_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk3_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk3_Res1_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk3_Res1_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk3_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk3_Res1_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk3_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg2_Blk3_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg2_Blk3_Res1_relu", 0, 0, {}]]]}, {"name": "Stg2_Blk3_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg2_Blk3_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg2_Blk3_Res2_conv", 0, 0, {}]]]}, {"name": "Stg2_Blk3_add", "class_name": "Add", "config": {"name": "Stg2_Blk3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg2_Blk2_relu", 0, 0, {}], ["Stg2_Blk3_Res2_bn", 0, 0, {}]]]}, {"name": "Stg2_Blk3_relu", "class_name": "Activation", "config": {"name": "Stg2_Blk3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg2_Blk3_add", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Stg2_Blk3_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk1_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk1_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "Stg3_Blk1_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk1_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk1_Res1_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk1_Res1_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk1_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk1_Res1_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk1_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk1_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg3_Blk1_Res1_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk1_lin_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk1_lin_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "Stg3_Blk1_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk1_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk1_Res2_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk1_add", "class_name": "Add", "config": {"name": "Stg3_Blk1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg3_Blk1_lin_conv", 0, 0, {}], ["Stg3_Blk1_Res2_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk1_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk1_add", 0, 0, {}]]]}, {"name": "Stg3_Blk2_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk2_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg3_Blk1_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk2_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk2_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk2_Res1_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk2_Res1_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk2_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk2_Res1_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk2_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk2_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg3_Blk2_Res1_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk2_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk2_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk2_Res2_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk2_add", "class_name": "Add", "config": {"name": "Stg3_Blk2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg3_Blk1_relu", 0, 0, {}], ["Stg3_Blk2_Res2_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk2_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk2_add", 0, 0, {}]]]}, {"name": "Stg3_Blk3_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk3_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg3_Blk2_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk3_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk3_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk3_Res1_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk3_Res1_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk3_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk3_Res1_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk3_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg3_Blk3_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg3_Blk3_Res1_relu", 0, 0, {}]]]}, {"name": "Stg3_Blk3_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg3_Blk3_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg3_Blk3_Res2_conv", 0, 0, {}]]]}, {"name": "Stg3_Blk3_add", "class_name": "Add", "config": {"name": "Stg3_Blk3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg3_Blk2_relu", 0, 0, {}], ["Stg3_Blk3_Res2_bn", 0, 0, {}]]]}, {"name": "Stg3_Blk3_relu", "class_name": "Activation", "config": {"name": "Stg3_Blk3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg3_Blk3_add", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Stg3_Blk3_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk1_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk1_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "Stg4_Blk1_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk1_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk1_Res1_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk1_Res1_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk1_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk1_Res1_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk1_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk1_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg4_Blk1_Res1_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk1_lin_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk1_lin_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "Stg4_Blk1_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk1_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk1_Res2_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk1_add", "class_name": "Add", "config": {"name": "Stg4_Blk1_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg4_Blk1_lin_conv", 0, 0, {}], ["Stg4_Blk1_Res2_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk1_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk1_add", 0, 0, {}]]]}, {"name": "Stg4_Blk2_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk2_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg4_Blk1_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk2_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk2_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk2_Res1_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk2_Res1_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk2_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk2_Res1_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk2_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk2_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg4_Blk2_Res1_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk2_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk2_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk2_Res2_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk2_add", "class_name": "Add", "config": {"name": "Stg4_Blk2_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg4_Blk1_relu", 0, 0, {}], ["Stg4_Blk2_Res2_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk2_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk2_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk2_add", 0, 0, {}]]]}, {"name": "Stg4_Blk3_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk3_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg4_Blk2_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk3_Res1_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk3_Res1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk3_Res1_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk3_Res1_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk3_Res1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk3_Res1_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk3_Res2_conv", "class_name": "Conv2D", "config": {"name": "Stg4_Blk3_Res2_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Stg4_Blk3_Res1_relu", 0, 0, {}]]]}, {"name": "Stg4_Blk3_Res2_bn", "class_name": "BatchNormalization", "config": {"name": "Stg4_Blk3_Res2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Stg4_Blk3_Res2_conv", 0, 0, {}]]]}, {"name": "Stg4_Blk3_add", "class_name": "Add", "config": {"name": "Stg4_Blk3_add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Stg4_Blk2_relu", 0, 0, {}], ["Stg4_Blk3_Res2_bn", 0, 0, {}]]]}, {"name": "Stg4_Blk3_relu", "class_name": "Activation", "config": {"name": "Stg4_Blk3_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["Stg4_Blk3_add", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Stg4_Blk3_relu", 0, 0, {}]]]}, {"name": "Stg5_Blk1_Res1_conv", "class_name": "Conv2D", "config": {"name": "Stg5_Blk1_Res1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", 